app/controllers/attendance_reports_controller.rb

  def index
    @batches = Batch.active
    @config = Configuration.find_by_config_key('StudentAttendanceType')
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1

  def mode
    @batch = Batch.find params[:batch_id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def show
    @batch = Batch.find params[:batch_id]
    @start_date = @batch.start_date.to_date
    @end_date = Date.today.to_date

    @mode = params[:mode]
    @config = Configuration.find_by_config_key('StudentAttendanceType')
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1

  def year
    @batch = Batch.find params[:batch_id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def report
    @batch = Batch.find params[:batch_id]
    @month = params[:month]
    @year = params[:year]
    @students = Student.find_all_by_batch_id(@batch.id)
    @config = Configuration.find_by_config_key('StudentAttendanceType')
#    @date = "01-#{@month}-#{@year}"
    @date = '01-'+@month+'-'+@year
    @start_date = @date.to_date
    @today = Date.today
    unless @start_date > Date.today
      if @month == @today.month.to_s
        @end_date = Date.today
      else
        @end_date = @start_date.end_of_month
      end

      if @config.config_value == 'Daily'
        @report = PeriodEntry.find_all_by_batch_id(@batch.id, :conditions =>{:month_date => @start_date..@end_date})
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`batch_id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1
SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` BETWEEN '2011-01-01' AND '2011-01-02') AND (`period_entries`.`batch_id` = 1)