app/controllers/batches_controller.rb

  def update
    if @batch.update_attributes(params[:batch])
---
UPDATE `batches` SET `name` = 'Noite 1' WHERE `id` = 1