app/controllers/batch_transfers_controller.rb

  def subject_transfer
    @batch = Batch.find(params[:id])
    @elective_groups = @batch.elective_groups
    @normal_subjects = @batch.normal_batch_subject
    @elective_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>["elective_group_id IS NOT NULL AND is_deleted = false"])
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)

  def new_subject
    @subject = Subject.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def create_subject
    @subject = Subject.new(params[:subject])
    @batch = @subject.batch
    if @subject.save
      @subjects = @subject.batch.normal_batch_subject
      @normal_subjects = @subjects
      @elective_groups = ElectiveGroup.find_all_by_batch_id(@batch.id)
      @elective_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>["elective_group_id IS NOT NULL AND is_deleted = false"])
---
INSERT INTO `subjects` (`name`, `created_at`, `code`, `max_weekly_classes`, `updated_at`, `batch_id`, `no_exams`, `is_deleted`, `elective_group_id`) VALUES('Meteoro', '2011-01-03 01:46:35', '1', 2, '2011-01-03 01:46:35', 1, 0, 0, NULL)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`batch_id` = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)