app/controllers/courses_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = '1')
---
  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => {:is_deleted => false, :is_active => true})

INSERT INTO `courses` (`created_at`, `code`, `updated_at`, `course_name`, `is_deleted`, `section_name`) VALUES('2011-01-02 23:59:38', 'pc-n-2010', '2011-01-02 23:59:38', 'PC Noite', 0, 'PC')
---
  def create
    @course = Course.new params[:course]
    if @course.save

UPDATE `courses` SET `updated_at` = '2011-04-17 19:50:18', `course_name` = 'PC' WHERE `id` = 1
---
  def update
    if @course.update_attributes(params[:course])

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
---
  def find_course
    @course = Course.find params[:id]