app/controllers/elective_groups_controller.rb

INSERT INTO `elective_groups` (`name`, `created_at`, `updated_at`, `batch_id`, `is_deleted`) VALUES('Medicina aeronautica', '2011-01-03 01:48:21', '2011-01-03 01:48:21', 1, 0)
---
  def create
    @elective_group = ElectiveGroup.new(params[:elective_group])
    @elective_group.batch_id = @batch.id
    if @elective_group.save

SELECT * FROM `subjects` WHERE (is_deleted = false) AND (`subjects`.`batch_id` = 1 AND `subjects`.`elective_group_id` = 1)
---
  def show
    @electives = Subject.find_all_by_batch_id_and_elective_group_id(@batch.id, @elective_group.id, :conditions=>["is_deleted = false"])