app/controllers/employee_controller.rb

INSERT INTO `employee_categories` (`name`, `prefix`, `status`) VALUES('Professor', 'prof', 1)
---
  def add_category
    @categories = EmployeeCategory.find(:all)
    @category = EmployeeCategory.new(params[:category])
    if request.post? and @category.save

SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 1)
---
  def add_position
    @positions = EmployeePosition.find(:all)
    @categories = EmployeeCategory.find(:all,:order => "name asc")

SELECT * FROM `employees` WHERE (employee_number != 'admin') ORDER BY employees.id DESC LIMIT 1
SELECT * FROM `countries`
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'EmployeeNumberAutoIncrement') LIMIT 1
---
  def admission1
    @user = current_user
    @user_name = @user.username
    @employee1 = Employee.find_by_employee_number(@user_name)
    @categories = EmployeeCategory.find(:all,:order => "name asc")
    @positions = []
    @grades = EmployeeGrade.find(:all,:order => "name asc")
    @departments = EmployeeDepartment.find(:all,:order => "name asc")
    @nationalities = Country.all
    @employee = Employee.new(params[:employee])
    @last_admitted_employee = Employee.find(:last,:conditions=>"employee_number != 'admin'")
    @config = Configuration.find_by_config_key('EmployeeNumberAutoIncrement')

SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 2)
SELECT * FROM `employee_positions` WHERE (`employee_positions`.`employee_category_id` = 2)
---
  def update_positions
    category = EmployeeCategory.find(params[:category_id])
    @positions = EmployeePosition.find_all_by_employee_category_id(category.id)

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `payroll_categories` WHERE (`payroll_categories`.`status` = 1 AND `payroll_categories`.`payroll_category_id` IS NULL)
SELECT * FROM `individual_payslip_categories` WHERE (include_every_month = true) AND (`individual_payslip_categories`.`employee_id` = 1)
SELECT * FROM `individual_payslip_categories` WHERE (`individual_payslip_categories`.`employee_id` = 1 AND `individual_payslip_categories`.`salary_date` IS NULL)
SELECT * FROM `privileges` WHERE (`privileges`.`id` = 14)
SELECT * FROM `users` INNER JOIN `privileges_users` ON `users`.id = `privileges_users`.user_id WHERE (`privileges_users`.privilege_id = 14 )
SELECT * FROM `employee_salary_structures` WHERE (`employee_salary_structures`.`employee_id` = 1 AND `employee_salary_structures`.`payroll_category_id` = 1) LIMIT 1
---
  def create_monthly_payslip
    @new_payslip_category == []
    @employee = Employee.find(params[:id])
    @independent_categories = PayrollCategory.find_all_by_payroll_category_id_and_status(nil, true)
    @dependent_categories = PayrollCategory.find_all_by_status(true, :conditions=>"payroll_category_id != \'\'")
    @employee_additional_categories = IndividualPayslipCategory.find_all_by_employee_id(@employee.id, :conditions=>"include_every_month = true")
    @new_payslip_category = IndividualPayslipCategory.find_all_by_employee_id_and_salary_date(@employee.id,nil)
    @user = current_user
    privilege = Privilege.find(14)
    finance_manager = privilege.users
    subject = " Payslip generated"
    body = "Payslip has been generated for "+@employee.first_name+" "+@employee.last_name+". Kindly approve this request"
    finance_manager.each do |f|
      Reminder.create(:sender=>@user.id, :recipient=>f.id, :subject=> subject,
        :body => body, :is_read=>false, :is_deleted_by_sender=>false,:is_deleted_by_recipient=>false)
    end

    if request.post?
      salary_date = Date.parse(params[:salary_date])
      start_date = salary_date - ((salary_date.day - 1).days)
      end_date = start_date + 1.month
      payslip_exists = MonthlyPayslip.find_all_by_employee_id(@employee.id,
        :conditions => ["salary_date >= ? and salary_date < ?", start_date, end_date])
      if payslip_exists == []
        params[:manage_payroll].each_pair do |k, v|
          row_id = EmployeeSalaryStructure.find_by_employee_id_and_payroll_category_id(@employee, k)

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (is_deleted=false) AND (`subjects`.`batch_id` = 1)
---
  def update_subjects
    batch = Batch.find(params[:batch_id])
    @subjects = Subject.find_all_by_batch_id(batch.id,:conditions=>"is_deleted=false")

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
---
  def select_department
    @subject = Subject.find(params[:subject_id])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1')
---
  def update_employees
    @subject = Subject.find(params[:subject_id])
    @employees = Employee.find_all_by_employee_department_id(params[:department_id])

SELECT * FROM `employee_departments` WHERE (`employee_departments`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = 1)
INSERT INTO `employees_subjects` (`employee_id`, `subject_id`) VALUES(1, 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
---
  def assign_employee
    @departments = EmployeeDepartment.find(:all)
    @subject = Subject.find(params[:id1])
    @employees = Employee.find_all_by_employee_department_id(Employee.find(params[:id]).employee_department_id)
    EmployeesSubject.create(:employee_id => params[:id], :subject_id => params[:id1])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)

SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
---
  def hr
    user = current_user
    @employee = Employee.find_by_employee_number(user.username)

SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1')
---
  def update_employee_select_list
    department_id = params[:department_id]
    @employees = Employee.find_all_by_employee_department_id(department_id)

SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'HR') LIMIT 1
SELECT * FROM `employees`
SELECT * FROM `monthly_payslips` WHERE (salary_date >= '2011-01-01' and salary_date < '2011-02-01') AND (`monthly_payslips`.`employee_id` = 1)
SELECT * FROM `employee_salary_structures` WHERE (`employee_salary_structures`.`employee_id` = 1)
---
  def one_click_payslip_generation

    @user = current_user
    finance_manager = find_finance_managers
    finance = Configuration.find_by_config_value("Finance")
    subject = " Payslip generated"
    body = "Payslip has been generated for the particular month. Kindly approve this request"
    salary_date = Date.parse(params[:salary_date])
    start_date = salary_date - ((salary_date.day - 1).days)
    end_date = start_date + 1.month
    employees = Employee.find(:all)
    unless(finance_manager.nil? and finance.nil?)
      finance_manager.each do |f|
        Reminder.create(:sender=>@user.id, :recipient=>f.id, :subject=> subject,
          :body => body, :is_read=>false, :is_deleted_by_sender=>false,:is_deleted_by_recipient=>false)
      end
      employees.each do|e|
        payslip_exists = MonthlyPayslip.find_all_by_employee_id(e.id,
          :conditions => ["salary_date >= ? and salary_date < ?", start_date, end_date])
        if payslip_exists == []
          salary_structure = EmployeeSalaryStructure.find_all_by_employee_id(e.id)

SELECT * FROM `employee_departments` WHERE (status = true) ORDER BY name ASC
SELECT distinct salary_date FROM `monthly_payslips` WHERE (is_approved = true)
---
  def department_payslip
    @departments = EmployeeDepartment.find(:all, :conditions=>"status = true", :order=> "name ASC")
    @salary_dates = MonthlyPayslip.find(:all, :conditions=>"is_approved = true",:select => "distinct salary_date")