app/controllers/exam_controller.rb

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`batch_id` = 1)
---
  def generated_report3
    #student-subject-wise-report
    @student = Student.find(params[:student])
    @batch = @student.batch
    @subject = Subject.find(params[:subject])
    @exam_groups = ExamGroup.find(:all, :conditions=>{:batch_id=>@batch.id})

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.batch_id = 1 AND (id < 1)) ORDER BY admission_no DESC LIMIT 1
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`batch_id` = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NULL AND is_deleted=false) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (batch_id = 1) AND (`students_subjects`.`student_id` = 1)
---
  def generated_report4
    if params[:student].nil?
      if params[:exam_report].nil? or params[:exam_report][:batch_id].empty?
        flash[:notice] = t('exam.selectBatchContinue')
        redirect_to :action=>'grouped_exam_report' and return
      end
    else
      if params[:type].nil?
        flash[:notice] = t('exam.invalidParameters')
        redirect_to :action=>'grouped_exam_report' and return
      end
    end
    #grouped-exam-report-for-batch
    if params[:student].nil?
      @type = params[:type]
      @batch = Batch.find(params[:exam_report][:batch_id])
      @student = @batch.students.first
      if @type == 'grouped'
        @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
        @exam_groups = []
        @grouped_exams.each do |x|
          @exam_groups.push ExamGroup.find(x.exam_group_id)
        end
      else
        @exam_groups = ExamGroup.find_all_by_batch_id(@batch.id)
      end
      general_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>"elective_group_id IS NULL AND is_deleted=false")
      student_electives = StudentsSubject.find_all_by_student_id(@student.id, :conditions=>"batch_id = #{@batch.id}")

SELECT * FROM `students` WHERE (`students`.batch_id = 1 AND (id < 1)) ORDER BY admission_no DESC LIMIT 1
---
  def previous_years_marks_overview
    @student = Student.find(params[:student])

SELECT * FROM `batches` WHERE (`batches`.`is_active` = 1 AND `batches`.`is_deleted` = 0) AND (`batches`.`course_id` = '1')
---
  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => {:is_deleted => false, :is_active => true})

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `exams` WHERE (`exams`.`subject_id` = 1) ORDER BY start_time asc
---
  def graph_for_generated_report3
    student = Student.find params[:student]
    subject = Subject.find params[:subject]
    exams = Exam.find_all_by_subject_id(subject.id, :order => 'start_time asc')

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
---
  def graph_for_previous_years_marks_overview
    student = Student.find(params[:student])

    x_labels = []
    data = []

    student.all_batches.each do |b|