app/controllers/finance_controller.rb

SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'Finance') LIMIT 1
---
  def index
    @hr = Configuration.find_by_config_value("HR")

SELECT * FROM `finance_transaction_categories` WHERE (is_income = true AND name NOT LIKE 'Fee' AND name NOT LIKE 'Donation')
SELECT count(*) AS count_all FROM `finance_transaction_categories` WHERE (is_income = true AND name NOT LIKE 'Fee' AND name NOT LIKE 'Donation')
---
  def income_create
    flash[:notice]=nil
    @income = FinanceTransaction.new(params[:transaction])
    @categories = FinanceTransactionCategory.income_categories
    if @categories.empty?

SELECT * FROM `finance_fee_categories` WHERE (is_deleted = 'false' and is_master = 1) LIMIT 0, 10
SELECT * FROM `student_categories`
---
  def master_fees
    @finance_fee_category = FinanceFeeCategory.new
    @finance_fee_particular = FinanceFeeParticulars.new
    @batches = Batch.active
    @master_categories = FinanceFeeCategory.paginate(:page => params[:page],:conditions=> ["is_deleted = '#{false}' and is_master = 1"])
    @student_categories = StudentCategory.find :all

INSERT INTO `finance_fee_categories` (`name`, `created_at`, `is_master`, `updated_at`, `batch_id`, `is_deleted`, `description`) VALUES('Gerais', '2011-01-03 00:27:02', 1, '2011-01-03 00:27:02', 1, 0, '')
SELECT * FROM `finance_fee_categories` WHERE (is_deleted = 'false' and is_master = 1) LIMIT 0, 10
---
  def master_category_create
    @finance_fee_category = FinanceFeeCategory.new(params[:finance_fee_category])
    @finance_fee_category.is_master = true
    unless @finance_fee_category.save
      @error = true
    end
    @master_categories = FinanceFeeCategory.paginate(:page => params[:page] ,:conditions=> ["is_deleted = '#{false}' and is_master = 1"])

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `finance_fee_collections` WHERE (`finance_fee_collections`.`fee_category_id` = 1)
---
  def load_fees_submission_batch

    @batch   = Batch.find(params[:batch_id])
    @dates   = FinanceFeeCollection.find(:all)
    @date    = FinanceFeeCollection.find(params[:date])
    @student = Student.find(params[:student]) if params[:student]

    @student ||= @batch.students.first
    @prev_student = @student.previous_student
    @next_student = @student.next_student

    @financefee = @student.finance_fee_by_date @date
    @fee_collection = FinanceFeeCollection.find(params[:date])
    @due_date = @fee_collection.due_date

    @fee_category = FinanceFeeCategory.find(@fee_collection.fee_category_id,:conditions => ["is_deleted = false"])