app/controllers/grading_levels_controller.rb

  def new
    @grading_level = GradingLevel.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def show
    @batch = nil
    if params[:batch_id] == ''
      @grading_levels = GradingLevel.default
    else
      @grading_levels = GradingLevel.for_batch(params[:batch_id])
      @batch = Batch.find params[:batch_id] unless params[:batch_id] == ''
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)