app/controllers/news_controller.rb

  def add
    @news = News.new(params[:news])
    @news.author = current_user
    if request.post? and @news.save
---
INSERT INTO `news` (`created_at`, `title`, `updated_at`, `content`, `author_id`) VALUES('2011-04-17 16:33:25', 'fedena', '2011-04-17 16:33:25', '<p>fedena</p>\r\n<p>&nbsp;</p>', 1)

  def all
    @news = News.paginate :page => params[:page]
---
SELECT * FROM `news` ORDER BY created_at DESC LIMIT 0, 12

  def view
    @current_user = current_user
    @news = News.find(params[:id])
---
SELECT * FROM `news` WHERE (`news`.`id` = 1) ORDER BY created_at DESC