app/controllers/payroll_controller.rb

SELECT * FROM `payroll_categories` WHERE (`payroll_categories`.`is_deduction` = 0) ORDER BY name ASC
INSERT INTO `payroll_categories` (`name`, `payroll_category_id`, `percentage`, `is_deduction`, `status`) VALUES('ProfessorPayroll', NULL, 10.0, 0, 1)
---
  def add_category
    @categories = PayrollCategory.find_all_by_is_deduction(false, :order=> "name ASC")
    @deductionable_categories = PayrollCategory.find_all_by_is_deduction(true, :order=> "name ASC")
    @category = PayrollCategory.new(params[:category])
    if request.post? and @category.save