app/controllers/student_attendance_controller.rb

  def student
    @config = Configuration.find_by_config_key('StudentAttendanceType')
    @student = Student.find(params[:id])
    @batch = Batch.find(@student.batch_id)
    @subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>'is_deleted = false')
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (is_deleted = false) AND (`subjects`.`batch_id` = 1)