app/controllers/student_controller.rb

SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AdmissionNumberAutoIncrement') LIMIT 1
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '1' AND `students`.id <> 1) LIMIT 1
INSERT INTO `students` (`city`, `photo_filename`, `pin_code`, `created_at`, `student_category_id`, `admission_no`, `nationality_id`, `immediate_contact_id`, `photo_data`, `updated_at`, `batch_id`, `language`, `country_id`, `photo_content_type`, `gender`, `phone1`, `admission_date`, `blood_group`, `phone2`, `status_description`, `is_deleted`, `last_name`, `is_active`, `date_of_birth`, `religion`, `is_sms_enabled`, `birth_place`, `address_line1`, `class_roll_no`, `first_name`, `middle_name`, `address_line2`, `state`, `email`) VALUES('Rio de Janeiro', NULL, '', '2011-01-03 00:50:51', NULL, '1', 76, NULL, NULL, '2011-01-03 00:50:51', 1, 'portuguese', 76, NULL, 'm', '2182371117', '2011-01-02', 'A+', '2182371117', NULL, 0, 'Moreira', 1, '2006-01-02', '', 1, 'Rio de janeiro', 'Tr. Afonso, 12', NULL, 'Filipe', '', 'Ap 102, Tijuca', 'RJ', 'filipefumaux@gmail.com')
---
  def admission1
    @student = Student.new(params[:student])
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = Configuration.find_by_config_key('AdmissionNumberAutoIncrement')
    if request.post?
      @exist = Student.find_by_admission_no(params[:student][:admission_no])
      if @exist.nil?
        @student.save

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT `guardians`.* FROM `guardians` WHERE (`guardians`.ward_id = 1)
---
  def admission2
    @student = Student.find params[:id], :include => [:guardians]

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT count(*) AS count_all FROM `guardians` WHERE (`guardians`.ward_id = 1)
---
  def admission3
    @student = Student.find(params[:id])
    @parents = @student.guardians
    if @parents.empty?

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `student_previous_subject_marks` WHERE (`student_previous_subject_marks`.`student_id` = 1)
INSERT INTO `student_previous_datas` (`student_id`, `course`, `institution`, `total_mark`, `year`) VALUES(1, 'Analise de sistemas', 'Estácio de sá', '360', '2001')
---
  def previous_data
    @student = Student.find(params[:id])
    @previous_data = StudentPreviousData.new params[:student_previous_details]
    @previous_subject = StudentPreviousSubjectMark.find_all_by_student_id(@student)
    if request.post?
      @previous_data.save

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `student_additional_fields` WHERE (status = true)
---
  def admission4
    @student = Student.find(params[:id])
    @additional_fields = StudentAdditionalField.find(:all, :conditions=> "status = true")

INSERT INTO `student_additional_fields` (`name`, `status`) VALUES('teste1', 1)
---
  def add_additional_details
    @additional_details = StudentAdditionalField.find(:all)
    @additional_field = StudentAdditionalField.new(params[:additional_field])
    if request.post? and @additional_field.save

SELECT * FROM `batches` INNER JOIN `batch_students` ON `batches`.id = `batch_students`.batch_id WHERE (`batch_students`.student_id = 1 )
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 1)
SELECT * FROM `subjects` WHERE (no_exams = false AND elective_group_id IS NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (`students_subjects`.`batch_id` = 1) AND (`students_subjects`.`student_id` = 1)
---
  def reports
    @batch = @student.batch
    @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
    @normal_subjects = Subject.find_all_by_batch_id(@batch.id,:conditions=>"no_exams = false AND elective_group_id IS NULL AND is_deleted = false")
    @student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>{:batch_id=>@batch.id})

SELECT * FROM `students` WHERE (`students`.`batch_id` = '1') ORDER BY first_name ASC
---
  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')

SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def profile
    @current_user = current_user
    @address = @student.address_line1 + ' ' + @student.address_line2
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''

SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `student_previous_subject_marks` WHERE (`student_previous_subject_marks`.`student_id` = 1)
---
  def show_previous_details
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @previous_subjects = StudentPreviousSubjectMark.find_all_by_student_id(@student.id)

SELECT * FROM `student_categories`
INSERT INTO `student_categories` (`name`, `is_deleted`) VALUES('categoria estudante', NULL)
---
  def categories
    @student_categories = StudentCategory.find :all
    @student_category = StudentCategory.new(params[:student_category])
    if request.post? and @student_category.save

SELECT * FROM `students` ORDER BY students.id DESC LIMIT 1
---
  def find_student
    @student = Student.find params[:id]