app/controllers/subjects_controller.rb

  def new
    @subject = Subject.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]
    @elective_group = ElectiveGroup.find params[:id2] unless params[:id2].nil?
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`id` = 1)

  def show
    if params[:batch_id] == ''
      @subjects = []
    else
      @batch = Batch.find params[:batch_id]
      @subjects = @batch.normal_batch_subject
      @elective_groups = ElectiveGroup.find_all_by_batch_id(params[:batch_id])
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`batch_id` = '1')