app/controllers/timetable_controller.rb

  def generate
    @batches = Batch.active
    if request.post?
      @batch = Batch.find params[:timetable][:batch_id]
      @config = Configuration.find_by_config_key('StudentAttendanceType')
      @start_date = @batch.start_date.to_date
      @end_date = @batch.end_date.to_date
      holiday = []
      @holiday = Weekday.find_all_by_batch_id(@batch.id)
      @holiday = Weekday.default if @holiday.empty?
      flash[:notice] = 'You have set the weekdays!' if @holiday.empty?
      @holiday.each do |h|
        holiday.push h.weekday
      end
      set = 0
      (@start_date..@end_date).each do |d|
        w = d.wday.to_s
        @period = PeriodEntry.find_all_by_month_date_and_batch_id(d, @batch.id)
        if @period.empty?
          unless Event.is_a_holiday?(d)
            if holiday.include? w
              unless @config.config_value == 'Daily'
                @timetable = TimetableEntry.find_all_by_batch_id_and_week_day_id(@batch.id, d.wday)
                @timetable.each do |t|
                  PeriodEntry.create(:month_date=> d, :batch_id => @batch.id, :subject_id => t.subject_id, :class_timing_id => t.class_timing_id, :employee_id => t.employee_id)
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL) ORDER BY weekday asc
SELECT count(*) AS count_all FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL)
SELECT * FROM `period_entries` WHERE (`period_entries`.`batch_id` = 1 AND `period_entries`.`month_date` = '2011-01-02')
INSERT INTO `period_entries` (`class_timing_id`, `month_date`, `batch_id`, `subject_id`, `employee_id`) VALUES(NULL, '2011-01-03', 1, NULL, NULL)

  def select_class2
    @weekday = [t('sun'), t('mon'), t('tue'), t('wed'), t('thu'), t('fri'), t('sat')]
    @batches = Batch.active
    if request.post?
      unless params[:timetable_entry][:batch_id].empty?
        @batch = Batch.find(params[:timetable_entry][:batch_id])
        @class_timings = ClassTiming.find_all_by_batch_id(@batch.id, :conditions => "is_break = false")
        if @class_timings.empty?
          @class_timings = ClassTiming.default
        end
        @day = Weekday.find_all_by_batch_id(@batch.id)
        if @day.empty?
          @day = Weekday.default
        end
        @day.each do |d|
          @class_timings.each do |p|
            TimetableEntry.create(:batch_id=>@batch.id, :week_day_id => d.weekday, :class_timing_id => p.id) \
              if TimetableEntry.find_by_batch_id_and_week_day_id_and_class_timing_id(@batch.id, d.weekday, p.id).nil?
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `class_timings` WHERE (`class_timings`.`batch_id` IS NULL AND `class_timings`.`is_break` = 0)
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`class_timing_id` = 1 AND `timetable_entries`.`batch_id` = 1 AND `timetable_entries`.`week_day_id` = '1') LIMIT 1
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL) ORDER BY weekday asc
INSERT INTO `timetable_entries` (`class_timing_id`, `batch_id`, `subject_id`, `employee_id`, `week_day_id`) VALUES(1, 1, NULL, NULL, 1)

  def edit2
    @weekday = [t('sun'), t('mon'), t('tue'), t('wed'), t('thu'), t('fri'), t('sat')]
    @errors = {"messages" => []}
    @batch = Batch.find(params[:id])
    @timetable = TimetableEntry.find_all_by_batch_id(params[:id])
    @class_timing = ClassTiming.find_all_by_batch_id(@batch.id, :conditions => "is_break = false")
    if @class_timing.empty?
      @class_timing = ClassTiming.default
    end
    @day = Weekday.find_all_by_batch_id(@batch.id)
    if @day.empty?
      @day = Weekday.default
    end
    @subjects = Subject.find_all_by_batch_id(@batch.id)
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`batch_id` = '1')
SELECT * FROM `class_timings` WHERE (`class_timings`.`batch_id` IS NULL AND `class_timings`.`is_break` = 0)
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL) ORDER BY weekday asc
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1) GROUP BY elective_group_id

  def update_employees
    @weekday = [t('sun'), t('mon'), t('tue'), t('wed'), t('thu'), t('fri'), t('sat')]
    if params[:subject_id] == ""
      render :text => ""
      return
    end
    @employees_subject = EmployeesSubject.find_all_by_subject_id(params[:subject_id])
---
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = '1')