app/controllers/user_controller.rb

  def all
    @users = User.all
---
SELECT * FROM `users`

  def list_user
    if params[:user_type] == 'Admin'
      @users = User.find(:all, :conditions => {:admin => true}, :order => 'first_name ASC')
      render(:update) do |page|
        page.replace_html 'users', :partial=> 'users'
        page.replace_html 'employee_user', :text => ''
        page.replace_html 'student_user', :text => ''
      end
    elsif params[:user_type] == 'Employee'
      render(:update) do |page|
        hr = Configuration.find_by_config_value("HR")
---
SELECT * FROM `users` WHERE (`users`.`admin` = 1) ORDER BY first_name ASC
SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'HR') LIMIT 1

  def list_employee_user
    emp_dept = params[:dept_id]
    @employee = Employee.find_all_by_employee_department_id(emp_dept, :order =>'first_name ASC')
    @users = @employee.collect { |employee| employee.user }
---
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1') ORDER BY first_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def list_student_user
    batch = params[:batch_id]
    @student = Student.find_all_by_batch_id(batch, :conditions => {:is_active => true}, :order =>'first_name ASC')
    @users = @student.collect { |student| student.user }
---
SELECT * FROM `students` WHERE (`students`.`is_active` = 1) AND (`students`.`batch_id` = '1') ORDER BY first_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def dashboard
    @user = current_user
    #@reminders = @users.check_reminders
    @config = Configuration.available_modules
    @employee = Employee.find_by_employee_number(@user.username)
    @employee ||= Employee.first if current_user.admin?
    @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1

  def edit
    @user = User.find_by_username(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1

  def login
    @institute = Configuration.find_by_config_key("LogoName")
    if request.post? and params[:user]
      @user = User.new(params[:user])
      user = User.find_by_username @user.username
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'LogoName') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1

  def profile
    @config = Configuration.available_modules
    @current_user = current_user
    @username = @current_user.username if session[:user_id]
    @user = User.find_by_username(params[:id])
    @employee = Employee.find_by_employee_number(@user.username)
    @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1

  def header_link
    @user = current_user
    #@reminders = @users.check_reminders
    @config = Configuration.available_modules
    @employee = Employee.find_by_employee_number(@user.username)
    @employee ||= Employee.first if current_user.admin?
    @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1